examples/multiSolidMaterials/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
libs ("libthermalTopO.so");
application     adjointOptimisationFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1;
deltaT          1;
writeControl    timeStep;
writeInterval   1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  12;
timeFormat      general;
runTimeModifiable true;
