examples/multiSolidMaterials/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1440
(
0.000833333333335
0.0025
0.00416666666666
0.00583333333333
0.0075
0.00916666666667
0.0108333333333
0.0125
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
24
(
0.1
0.1
0.1
0.1
0.1
0.1
0.1
0.1
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
0.000833333333335
0.0025
0.00416666666667
0.00583333333333
0.0075
0.00916666666667
0.0108333333333
0.0125
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
0.000833333333335
0.0025
0.00416666666667
0.00583333333333
0.0075
0.00916666666667
0.0108333333333
0.0125
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
