examples/multiSolidMaterials/0/Ta
FoamFile { version 2.0; format ascii; class volScalarField; object Ta; }
dimensions [0 2 -2 -1 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet { type fixedValue; value uniform 0; }
    outlet { type fixedValue; value uniform 0; }
        bottomWall { type fixedValue; value uniform 0; }
    topWall { type fixedGradient; gradient uniform 0; }
    frontAndBack { type empty; }
}
