examples/multiSolidMaterials/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    bTilda
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.01;
    }
    "(p|pa)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-9;
        relTol          0.01;
    }
    "(U|Ua)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.01;
    }
    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
        maxIter         2000;
    }
    Ta
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
        maxIter         2000;
    }
}
relaxationFactors
{
    fields { p 0.3; pa 0.2; }
    equations { U 0.7; Ua 0.5; T 0.7; }
}
